app/views/posts/show.html.erb

SELECT "categories".* FROM "categories" INNER JOIN "categories_posts" ON "categories"."id" = "categories_posts"."category_id" WHERE "categories_posts"."post_id" = ?  [["post_id", 35]]
---
<h2><%= @post.title %></h2>
<% @post.categories.each do |c|%>