app/controllers/categories_controller.rb

INSERT INTO "categories" ("category_name", "created_at", "updated_at") VALUES (?, ?, ?)  [["category_name", "asdf"], ["created_at", "2015-03-16 21:17:30.090590"], ["updated_at", "2015-03-16 21:17:30.090590"]]
---
	def create
		@category = Category.new(:category_name => params[:categories][:category_name])
		# @categories = Category.all
		if @category.save