app/controllers/posts_controller.rb

	def index
		@all_posts = Post.all
		@posts = @all_posts.sort_by(&:created_at).reverse
		@categories = Category.all
---
SELECT "posts".* FROM "posts"
SELECT "categories".* FROM "categories"

	def new
		@categories = Category.all
---
SELECT "categories".* FROM "categories"

	def create
		all_params = params
		@user = User.find_by_username(session[:username])
		@post = Post.new(:title => all_params[:title], :content=> all_params[:content])
		@user.posts << @post
		all_params.each do |key, value|
			if key.start_with?("category")
				category = Category.find_by_category_name(value)
---
INSERT INTO "posts" ("content", "created_at", "title", "updated_at") VALUES (?, ?, ?, ?)  [["content", "asdf"], ["created_at", "2014-09-04 07:29:30.787297"], ["title", "va"], ["updated_at", "2014-09-04 07:29:30.787297"]]
SELECT  "categories".* FROM "categories"  WHERE "categories"."category_name" = 'Satire' LIMIT 1

	def update
		@post = Post.find(params[:id])
        if @post.update_attributes(post_params)
---
SELECT  "posts".* FROM "posts"  WHERE "posts"."id" = ? LIMIT 1  [["id", 1]]
UPDATE "posts" SET "content" = ?, "updated_at" = ? WHERE "posts"."id" = 1  [["content", "what's up? Hi"], ["updated_at", "2014-09-04 07:41:37.841296"]]

	def destroy
	    @post = Post.find(params[:id])
        if @post.present?
        	@post.delete
---
SELECT  "posts".* FROM "posts"  WHERE "posts"."id" = ? LIMIT 1  [["id", 2]]
DELETE FROM "posts" WHERE "posts"."id" = ?  [["id", 2]]

	def upvote
		Post.increment_counter(:score, params[:id])
		@post = Post.find(params[:id])
---
UPDATE "posts" SET "score" = ?, "updated_at" = ? WHERE "posts"."id" = 12  [["score", 1], ["updated_at", "2014-09-06 18:13:34.271246"]]
SELECT  "posts".* FROM "posts"  WHERE "posts"."id" = ? LIMIT 1  [["id", 12]]

	def category_post
		@category = Category.find_by_category_name(params[:name])
---
SELECT  "categories".* FROM "categories"  WHERE "categories"."category_name" = 'Satire' LIMIT 1