app/controllers/posts_controller.rb

SELECT "posts".* FROM "posts"
---
	def dashboard
		@posts = Post.all